// 2 「お/ご〜する」以外の尊敬動詞
export const SONKEI_VERBS: string[] = [
    "いらっしゃる", "おっしゃる", "なす", "くだす", "召し上がる"
];
// おぼし + 召す は無理.. -> 1

// 2, 3 謙譲語I
export const KENJOU_VERBS_I: string[] = [
    "参上", "拝見", "頂戴", "承知","拝受","拝読","拝聴","拝察",
    "申し上げる", "差し上げる", "伺う","うかがう", "いただく", "申す", "存じる",
    "存じ上げる", "お目にかかる", "賜る", "いたす","お待ち", "差し上げる"
];
// 参らせ(参らせる) て いただく -> 1
// おい とま させ て いただく -> 1

// 4
export const MY_SIDE_WORDS: string[] = [
    "私", "わたくし", "わたし", "僕", "ぼく", "俺", "おれ", "弊社", "当社", "当方", "自分"
];

// 敬語表現で用いられる接頭辞（漢字も含む）
// 使ってない
export const HONORIFIC_PREFIXES: string[] = ["お", "ご", "御"];

// 4.? 自分側に用いると不適切になりやすい尊敬性の高い名詞語幹（例示）
export const RESPECTFUL_NOUN_STEMS: string[] = ["考え", "気持ち"];

// 2 敬称（「様」を重ねると二重になるもの）
export const KEISHOU_WORDS: string[] = [
    "社長", "部長", "課長", "係長", "主任", "先生", "先輩"
];
